// Дан массива строк  [‘10-02-2022’, ‘тест’, ‘11/12/2023’, ‘00/13/2022’, ‘41/12/2023’];

// Необходимо написать функцию, которая бы удаляла бы из массива все строки, которые нельзя перевести в дату (можно: 10-02-2022 и 11/12/2023) и возвращала новый массив вида:

// [‘10-02-2022’, ‘12-11-2023’]

arr = ['10-02-2022', 'тест', '11/12/2023', '00/13/2022', '41/12/2023'];

let dates = [];
for (el of arr) {
  if (el[2] === '-') {
    let date = el.split('-');
    if (date[0] <= 31 && date[1] <= 12) {
      dates.push(el);
    }
  } else if (el[2] === '/') {
    let date = el.split('/');
    if (date[0] <= 31 && date[1] <= 12) {
      let newDate = [date[1], date[0], date[2]];
      dates.push(newDate.join('-'));
    }
  }
  continue;
}

console.log(dates);
